In [4]:
import numpy as np
import pandas as pd

In [5]:
sozluk1 = {
          "Isim": ["Ahmet", "Mehmet", "Zeynep", "Atıl"],
          "Spor" : ["Kosu", "Yüzme", "Kosu", "Basketbol"],
          "Kalori": [100, 200, 300, 400]
          }

In [6]:
data_frame1 = pd.DataFrame(sozluk1, index = [0,1,2,3])

In [7]:
data_frame1

     Isim       Spor  Kalori
0   Ahmet       Kosu     100
1  Mehmet      Yüzme     200
2  Zeynep       Kosu     300
3    Atıl  Basketbol     400

In [8]:
sozluk2 = {"Isim": ["Osman", "Levent", "Atlas", "Fatma"],
          "Spor" : ["Kosu", "Yüzme", "Kosu", "Basketbol"],
          "Kalori": [200, 100, 50, 300]
          }

In [9]:
data_frame2 = pd.DataFrame(sozluk2, index = [4,5,6,7])

In [10]:
data_frame2

     Isim       Spor  Kalori
4   Osman       Kosu     200
5  Levent      Yüzme     100
6   Atlas       Kosu      50
7   Fatma  Basketbol     300

In [11]:
sozluk3 = {
    "Isim": ["Ayse", "Mahmut", "Duygu", "Nur"],
    "Spor": ["Kosu", "Yüzme", "Badminton", "Tenis"],
    "Kalori": [200, 100, 50, 300]
}

In [12]:
data_frame3 = pd.DataFrame(sozluk3, index = [8,9,10,11])

In [13]:
data_frame3

      Isim       Spor  Kalori
8     Ayse       Kosu     200
9   Mahmut      Yüzme     100
10   Duygu  Badminton      50
11     Nur      Tenis     300

# Concatenation

In [16]:
pd.concat([data_frame1, data_frame2, data_frame3])

      Isim       Spor  Kalori
0    Ahmet       Kosu     100
1   Mehmet      Yüzme     200
2   Zeynep       Kosu     300
3     Atıl  Basketbol     400
4    Osman       Kosu     200
5   Levent      Yüzme     100
6    Atlas       Kosu      50
7    Fatma  Basketbol     300
8     Ayse       Kosu     200
9   Mahmut      Yüzme     100
10   Duygu  Badminton      50
11     Nur      Tenis     300

In [15]:
## concat ile birden fazla taployu birbirine bağlar. Birleştime işlemini kolayca yapabilirsin

# Pandas DataFrame Birleştirme (`merge` Fonksiyonu)

**Pandas** kütüphanesi, veri analizi ve manipülasyonu için kullanılır. `merge()` fonksiyonu, SQL'deki **JOIN** işlemine benzer şekilde iki DataFrame'i birleştirir.

## a) Temel Kavramlar
- **`on`**: Hangi sütuna göre birleştirme yapılacağını belirtir.
- **`how`**: Birleştirmenin tipi (`inner`, `left`, `right`, `outer`).

## b) Birleştirme Türleri
- **`inner`**: Kesişim. Yalnızca her iki DataFrame'deki ortak değerleri içerir.
- **`left`**: Sol birleşim. Sol DataFrame'deki tüm satırları ve sağ DataFrame'deki eşleşen satırları içerir.
- **`right`**: Sağ birleşim. Sağ DataFrame'deki tüm satırları ve sol DataFrame'deki eşleşen satırları içerir.
- **`outer`**: Birleşim. Her iki DataFrame'deki tüm satırları içerir; eksik değerler `NaN` olarak gösterilir.

In [18]:
mergeSozluk1 = {"Isım" : ["Ahmet", "Mehmet", "Zeynep", "Atıl"],
               "Spor" : ["Koşu", "Yüzme", "Koşu", "Basketbol"]
               }

In [20]:
merge_dataframe1 = pd.DataFrame(mergeSozluk1)

In [21]:
merge_dataframe1

     Isım       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [24]:
mergeSozluk2 = {"Isım" : ["Ahmet", "Mehmet", "Zeynep", "Atıl"],
               "Kalori" : [100, 200, 150, 250]
               }

In [26]:
merge_dataframe2 = pd.DataFrame(mergeSozluk2)

In [27]:
merge_dataframe2

     Isım  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     150
3    Atıl     250

In [30]:
pd.merge(merge_dataframe1, merge_dataframe2, on= "Isım")

     Isım       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     150
3    Atıl  Basketbol     250

In [33]:
## Gödüğün gibi burada, Sutün birleştirme işlemi yapıldı
##1 Birleştireceğin DataFrame leri seçmen gerekiyor 
##2 on ile ortak olan değerleri belirlemen ve göstermen lazım

## iki dataframe i tek dökümasyonda tolamak için kullanıyoruz

In [35]:
maas_sozluk = {
    "isim": ["Atıl", "Zeynep", "Mehmet", "Ahmet"],
    "Departman": ["Yazılım", "Satıs", "Pazarlama", "Yazılım"],
    "Maas" : [200,300,400,500]
}

In [36]:
maas_dataframe = pd.DataFrame(maas_sozluk)

In [37]:
maas_dataframe

     isim  Departman  Maas
0    Atıl    Yazılım   200
1  Zeynep      Satıs   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [38]:
maas_dataframe["Departman"].unique()

array(['Yazılım', 'Satıs', 'Pazarlama'], dtype=object)

unique() fonksiyonu, bir veri kümesinde tekrarlayan elemanları çıkarıp sadece benzersiz (unique) elemanları bulmamızı sağlar. Bu, veri setinde hangi değerlerin olduğunu görmek istediğimizde kullanışlıdır.

In [39]:
maas_dataframe["Departman"].nunique()

3

In [40]:
# number of unique yani benzirsiz veri sayısını karşına çıkaracaktır

In [42]:
maas_dataframe["Departman"].value_counts()

Departman
Yazılım      2
Satıs        1
Pazarlama    1
Name: count, dtype: int64

In [43]:
## value_counts ise sana veri sayıyısı ve verileri karşına çıkarır

# DataFrame 'lerde kendi oluşturduğum fonksiyonları kullanmak.

In [46]:
def bruttenNete(maas):
    return maas * 0.66

In [47]:
maas_dataframe["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [50]:
## apply() method'u ile istediğin bir fonksiyonu DataFrame ' e uygulayabilirsin

In [51]:
## Burada DataFrame'deki maas değerinin %66 'sını buldu.

In [53]:
maas_dataframe.isnull()

    isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [54]:
## isnull(), Burada sana boş değer olup olmadığını kontrol ediyor

In [56]:
yeni_bir_veri = {
    "Karakter Sınıfı" : ["South Park", "South Park", "Simpson", "Simpson"],
    "Karakter Ismi" : ["Carman", "Kenny", "Homer", "Bart"],
    "Karakter Yas" : [9,10,50,20]
}

In [57]:
karakterDF = pd.DataFrame(yeni_bir_veri)

In [58]:
karakterDF

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park        Carman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20

In [61]:
karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter Sınıfı", "Karakter Ismi"])

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                   20.0
                Homer                  50.0
South Park      Carman                  9.0
                Kenny                  10.0

In [ ]:
## pivot_table() ile kolayca brleştirme işlemi yapabiliyorsun

pivot_table() fonksiyonu, bir DataFrame'deki verileri belirli sütunlara göre gruplandırarak, bu grupların özet istatistiklerini (örneğin, ortalama, toplam, maksimum gibi) hesaplayan ve sonuçları iki boyutlu bir tablo şeklinde sunan güçlü bir araçtır. Bu fonksiyon, özellikle büyük veri setlerinde anlamlı özet bilgiler çıkarmak için çok kullanışlıdır.

Özetle, pivot_table() fonksiyonuyla, verilerinizi gruplandırabilir, bu grupların istatistiklerini hesaplayabilir ve sonuçları tablo olarak organize edebilirsiniz.

In [68]:
yeni_bir_veri2 = {
    "Karakter Sınıfı" : ["South Park", "South Park", "Simpson", "Simpson", "Simpson"],
    "Karakter Ismi" : ["Carman", "Kenny", "Homer", "Bart", "Bart"],
    "Karakter Yas" : [9,10,50,20,100]
}

In [74]:
karakterDF2 = pd.DataFrame(yeni_bir_veri2)

In [86]:
karakterDF2.pivot_table(values='Karakter Yas', 
                                   index=['Karakter Sınıfı', 'Karakter Ismi'], 
                                   aggfunc="mean")

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                   60.0
                Homer                  50.0
South Park      Carman                  9.0
                Kenny                  10.0

## Özet İstatistikler

- **mean**: Ortalama
- **sum**: Toplam
- **max**: Maksimum
- **min**: Minimum
- **count**: Sayı
- **std**: Standart sapma
- **var**: Varyans

In [87]:
## aggfunc() method'una bu ifadelerden birini kullanarak değeri elde edebilirsin

In [88]:
## Örnek:
    ## bart 100 ve 20 ortalaması 60 Tır 
    ## bart 100 ve 20 sum(toplamı) 120 
    ## bart 100 ve 20 max(Maksimum değeri) 100 en büyük değeri verir